{
  "TODO": "KAIKKI",
  "proporcionar conexión por patrón singleton": "yksinkertainen kuvio",
  "Firstly, we create the object and the resolve function.": "Ensinnäkin luomme kohteen ja ratkaisun.",
  "Luego cargamos la API de base de datos.": "Lataa tietokanta API.",
  "Y al final definimos las funciones de inicio y cierre, y devolvemos el objeto de la API.": "Loppujen lopuksi määrittelemme aloitus- ja sulkemistoiminnot ja palautamme API:n kohteen.",
  "El API Loader es la función que se encarga de montar toda la API,\nque al final es un objeto que está accesible, normalmente,\no como `this` en los métodos del propio framework,\no como algún parámetro.\n": "Loader API on tehtävä, joka vastaa koko API:n asentamisesta.\nse, että loppujen lopuksi on tavoite, joka on yleensä saatavilla.\n’tällä’ itse puitteissa,\nkuin parametri.\n.",
  "Se dice que la API siempre está accesible porque, en general, este proyecto adopta patrones o ideas de la programación funcional. E intentar, aunque no estrictamente, que todas las variables que se usan en la función se proporcionen vía `this` o vía parámetros es una cláusula en mi estilo de programación.": "On sanottu, että API on aina saatavilla, koska yleensä tämä projekti omaksuu kuvioita tai ideoita toiminnallista ohjelmointia. Ja yritä, vaikka ei tiukasti, että kaikki funktiossa käytetyt muuttujat tarjotaan tämän tai parametrien kautta, on ohjelmointityylini lauseke.",
  "ATENCIÓN": "ATEENA",
  "los módulos deben estar en orden de carga, de lo contrario implementa tu propia estrategia o envuélvelo como 1 grupo.": "moduulien on oltava kuormituksen järjestyksessä, muuten toteuttaa oma strategia tai kääriä se yhteen ryhmään.",
  "Se dice que la API siempre está accesible porque, en general, este proyecto adopta patrones o ideas de la programación funcional. E intentar (no estrictamente) que todas las variables que se usan en la función se proporcionen vía `this` o vía parámetros es una cláusula en mi estilo de programación.": "On sanottu, että API on aina saatavilla, koska yleensä tämä projekti omaksuu kuvioita tai ideoita toiminnallista ohjelmointia. Ja yritä (ei tiukasti), että kaikki funktiossa käytetyt muuttujat tarjotaan tämän tai parametrien kautta, on ohjelmointityylini lauseke.",
  "i18n.hello": "Hei kaikki!"
}